core/app/MenuBuilder/CategoryMenu/StyleOneCategoryMenu.php

    function render($ids,$lang,$subcat_id=null,$title = null)
    {
        //it will have all html markup for the mega menu frontend
        $ids = explode(',',$ids);
        $sub_ids = explode(',',$subcat_id);
        $output = '';
        if (empty($ids)){
            return $output;
        }

        $mega_menu_items = ProductSubCategory::whereIn('id',$sub_ids)->get();
---
select * from `product_sub_categories` where `id` in ('8', '9', '10')