core/Modules/Product/Entities/Product.php

    public function getSubcategory()
    {
        $all_subcategories = [];
        $subcategory_id_arr = (array) json_decode($this->sub_category_id, true);

        foreach ($subcategory_id_arr as $subcategory_id) {
            $subcategory = ProductSubCategory::find($subcategory_id);
---
select * from `product_sub_categories` where `product_sub_categories`.`id` = '3' limit 1