core/app/Helpers/helpers.php

select * from `static_options` where `option_name` = 'site_maintenance_mode' limit 1
---
function get_static_option($key, $default = null)
{
    $option_name = $key;
    $value = \Illuminate\Support\Facades\Cache::remember($option_name, 3600, function () use ($option_name) {
        try {
            return StaticOption::where('option_name', $option_name)->first();
        } catch (\Exception $e) {
            return null;
        }
    });

select * from `languages` where `default` = 1 limit 1
---
function get_default_language()
{
    $defaultLang = Language::where('default', 1)->first();

select * from `media_uploads` where `media_uploads`.`id` = '469' limit 1
---
function get_attachment_image_by_id($id, $size = null, $default = false)
{
    $image_details = MediaUpload::find($id);

select * from `languages` where `default` = 1 limit 1
select * from `languages` where `slug` = 'en_GB' limit 1
---
function get_user_lang_direction()
{
    $default = \App\Language::where('default', 1)->first();
    $user_direction = \App\Language::where('slug', session()->get('lang'))->first();

select * from `widgets` where (`widget_location` = 'footer') order by `widget_order` asc
---
function render_admin_saved_widgets($location)
{
    $output = '';
    $all_widgets = \App\Widgets::where(['widget_location' => $location])->orderBy('widget_order', 'asc')->get();

select * from `languages` where `default` = 1 limit 1
---
function admin_default_lang()
{
    $default_lang = Language::where(['default' => 1, 'status' => 'publish'])->first();

select * from `product_categories` where `id` = 3 limit 1
---
function getQuickViewDataMarkup($item)
{
    $title = $item->title ?? "";
    $slug = $item->slug ?? "";
    $summary = $item->summary ?? "";
    $avg_rating = $item->rating_avg_rating ?? "";
    $stock_count = 0;



    $campaign_product = $item->campaign;
    $sale_price = $campaign_product ? $campaign_product->campaign_price : $item->sale_price;
    $deleted_price = $campaign_product ? $item->sale_price : $item->price;
    $campaign_percentage = $campaign_product ? getPercentage($item->sale_price, $sale_price) : false;

    $campaignSoldCount = \App\Campaign\CampaignSoldProduct::where("product_id",$item->id)->first();
    $stock_count = $campaign_product ? $campaign_product->units_for_sale - optional($campaignSoldCount)->sold_count ?? 0 : optional($item->inventory)->stock_count ?? 0;
    $stock_count = $stock_count > 0 ? $stock_count : 0;

    $deleted_price = $deleted_price > $sale_price ?  float_amount_with_currency_symbol($deleted_price) : false;

    $sale_price = float_amount_with_currency_symbol($sale_price);

    // category
    $category = $item->category_id ? ProductCategory::where('id', $item->category_id)->first() : null;