core/Modules/Product/Http/Controllers/FrontendProductController.php

select * from `product_colors` where `product_colors`.`id` in (1, 2)
select * from `product_inventory_details` where `product_inventory_details`.`product_id` in (3)
select * from `product_sizes` where `product_sizes`.`id` in (1, 3)
---
    public function productDetailsPage($slug)
    {
        $product = Product::where('slug', $slug)
                    ->with(
                        'additionalInfo',
                        'category',
                        'tags',
                        'inventoryDetails',
                        'inventoryDetails.productColor',
                        'inventoryDetails.productSize',
                        'inventoryDetails.includedAttributes'
                    )
                    ->where("status","publish")
                    ->firstOrFail();