core/Modules/Product/Http/Controllers/ProductCartController.php

    public function getCartInfoAjax() : array
    {
        $all_cart_items = CartHelper::getItems();
        $cart_item_ids = array_keys($all_cart_items);
        $product_stock_attributes = InventoryDetailsAttribute::where('product_id', $cart_item_ids)->get();
        $products = Product::whereIn('id', $cart_item_ids)->get();
---
select * from `inventory_details_attributes` where `product_id` = 60
select * from `products` where `id` in (60) and `products`.`deleted_at` is null